testCases/testCase2_Unsteady_refinement/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];//kg m s K mol A cd

internalField   uniform (0 0 0);//Initially the velocity is (0 0 0) m/s

boundaryField
{
    airInlet //atmosphere
    {
        type            pressureInletOutletVelocity;
		value	 		uniform (0 0 0);
    }
    
    waterInlet
    {
        type            fixedValue;
		value	 		uniform (0.41 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

	
    ".*Wall"
    {
        type            noSlip;//no slip along the walls - replaces fixedValue with uniform (0 0 0)
    }

}


// ************************************************************************* //
