testCases/testCase2_Unsteady_refinement/0_org/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	
    airInlet
    {
        type            inletOutlet;
		inletValue		uniform 0;//only air enters the domain
		value           uniform 0;
    }

    waterInlet
    {
        type            fixedValue;
		value	 		uniform 1;//only water enters the domain
    }

    outlet
    {
        type            zeroGradient;
    }
	
    ".*Wall"
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
