testCases/testCase2_Unsteady_refinement/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 6.3e-4;

boundaryField
{

    airInlet //atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    waterInlet
    {
        type            fixedValue;
		value	 		$internalField;
    }
	
    outlet
    {
        type            zeroGradient;
    }
	
    ".*Wall"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
