testCases/testCase2_Unsteady_refinement/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.47e-3;

boundaryField
{
	
    airInlet
    {
        type            calculated;
        value           uniform 0;
    }

    waterInlet
    {
        type            fixedValue;
		value	 		$internalField;
    }
	
    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    ".*Wall"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
