testCases/testCase2_Unsteady_refinement/0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.429; //calculated value

boundaryField
{

    airInlet // atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    waterInlet
    {
        type            fixedValue;
		value	 		$internalField;
    }
	
    outlet
    {
        type            zeroGradient;
    }

    ".*Wall"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
