testCases/testCase2_Unsteady_refinement/0_org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];//kg m s K mol A cd

internalField   uniform 0;//initially atmospheric pressure in the entire domain

boundaryField
{
	
    airInlet // atmosphere
    {
        type            totalPressure;
		p0	 			uniform 0; // stagnation pressure
    }

    waterInlet
    {
        type            fixedFluxPressure;
		value	 		uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }
	
    ".*Wall"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

}

// ************************************************************************* //
