testCases/testCase2_Unsteady_refinement/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;
//startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5.0;

deltaT          0.0001;

//writeControl    timeStep;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.01;


// ************************************************************************* //
// ************************************************************************* //

functions
{
	///////////////////////////////////////////////////////////////////////////
    /*
	minmaxdomain
	{
	    type fieldMinMax;

	    functionObjectLibs ("libfieldFunctionObjects.so");

	    enabled true; //true or false

	    mode component;

	    writeControl timeStep;
	    writeInterval 1;

	    log true;

	    fields (p p_rgh U alpha.water k omega);
	}
	*/

	///////////////////////////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////////////////////////
	/*
	water_in_domain
	{
	    type            volFieldValue;
	    functionObjectLibs ("libfieldFunctionObjects.so");
	    enabled         true;

	    writeFields off;

	    //writeControl     outputTime;
	    writeControl   timeStep;
	    writeInterval  1;

	    log             true;

	    regionType      all;

	    operation       volIntegrate;
	    fields
	    (
	        alpha.water
	    );
	}
	*/

	///////////////////////////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////////////////////////
	/*
	probes1
	{
	    type probes;
	    functionObjectLibs ("libsampling.so");
	    //dictionary probesDict;
	    probeLocations
	    (
			(0 0 0)
		    (5 0 0)
	    );

	    fields
	    (
		    p_rgh U
	    );

	    writeControl       timeStep;
	    writeInterval      1;
	}
	*/
	///////////////////////////////////////////////////////////////////////////

    waterInletFlux
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        log             true;
        // Output field values as well
        writeFields     false;
        regionType      patch;
        name            waterInlet;   // water inlet
        operation       sum;

        fields
        (
            rhoPhi
        );
    }
	/*
    outletFlux
    {
        $waterInletFlux;
        name            outlet;   //outlet
    }
	*/
    airInletFlux
    {
        $waterInletFlux;
        name            airInlet;    // air inlet; atmosphere;
    }

	///////////////////////////////////////////////////////////////////////////
	yplus
	{
	    type yPlus;
	    functionObjectLibs ("libutilityFunctionObjects.so");
	    enabled true;
	    writeControl outputTime;
	}
	///////////////////////////////////////////////////////////////////////////
	
}
