testCases/testCase2_Unsteady_refinement/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water     0
);

regions
(
    boxToCell
    {
        box (-1 -1 -1) (16 -0.0715 1);
        fieldValues
        (
             volScalarFieldValue alpha.water    1
	     volVectorFieldValue U			   (0.41 0 0) // initial velocity field
        );
    }

);


// ************************************************************************* //
